NXP/GenAVB_TSN-rtos-apps/boards/evkmimxrt1180/demo_apps/avb_tsn/common/cm33/pin_mux.c
/*
 * Copyright 2022-2023, 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v10.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8A
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitPhyAccessPins();
    BOARD_InitSwtPort0Pins();
    BOARD_InitSwtPort1Pins();
    BOARD_InitSwtPort2Pins();
    BOARD_InitSwtPort3Pins();
    BOARD_InitEpPins();
    BOARD_InitFlexSPIPins();
    BOARD_InitPPSPins();
    BOARD_InitHyperramPins();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPPSPins
 * Description   : Configures pin routing and optionally pin electrical features for PPS signal generation.
 *
 * END ****************************************************************************************************************/

void BOARD_InitPPSPins(void) {
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_26_NETC_TMR_PP1,          /* GPIO_AD_26 is configured as NETC_TMR_PP1 */
      1U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_26_NETC_TMR_PP1,          /* GPIO_AD_26 PAD functional properties : */
      0x06U);                                  /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_04_NETC_TMR_PP1,       /* GPIO_SD_B2_04 is configured as NETC_TMR_PP1 */
      1U);
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_SD_B2_04_NETC_TMR_PP1,       /* GPIO_SD_B2_04 PAD functional properties : */
      0x08U);                                  /* Open Drain field: Disabled
                                                  Pull Down Pull Up Field: Pull Down
                                                  PDRV Field: high driver */
}
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Open Drain LPSR Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Open Drain LPSR Field: Disabled */
}


